БИТУправление_медицинским_центром_демо/src/Catalogs/РЭМДПравилаПодписи/РЭМДПравилаПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РЭМДПравилаПодписи</name>
  <comment>1.2.643.5.1.13.13.99.2.42</comment>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.РегистрируемыеЭлектронныеМедДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПриПодписиМедДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксКолПодписей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинКолПодписей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Атрибуты</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/РЭМДПравилаПодписи/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

#Область ЗагрузкаИзЕГИСЗ

// Возвращает идентификатор основного классификатора источника на сайте росминздрава.
// 
// Возвращаемое значение:
//   - Строка
//
Функция ПолучитьOIDСправочника() Экспорт
	Возврат "1.2.643.5.1.13.13.99.2.42";
КонецФункции

// Описывает соответствие между именем реквизита в классификаторе и его именем в базе 1С.
// 
// Возвращаемое значение:
//   - Соответствие.
//
Функция ПолучитьСопоставленийРеквизитовИXMLСправочникаЕГИСЗ() Экспорт
	
	Сопоставление = Новый Соответствие;
	
	//1) ID, Уникальный идентификатор, Целочисленное, целое число, обязательное, Обязательное;
	Сопоставление.Вставить("ID", "УИДЕГИСЗ");
	//2) DOC_KIND, Вид документов, Строковое, целое число (связь со справочником 1.2.643.5.1.13.13.11.1520 по полю ID, отображаемое поле OID), обязательное, Обязательное;
	Сопоставление.Вставить("DOC_KIND", "ВидДокумента");
	//3) ROLE, Роль, Целочисленное, целое число (связь со справочником «Справочник ролей при подписи ЭМД» 1.2.643.5.1.13.2.1.1.734), обязательное, Обязательное;
	Сопоставление.Вставить("ROLE", "Роль");
	//4) SIGN_COUNT_MIN, Минимальное количество подписей, Целочисленное, целое число, обязательное, Обязательное;
	Сопоставление.Вставить("SIGN_COUNT_MIN", "МинКолПодписей");
	//5) SIGN_COUNT_MAX, Максимальное количество подписей, Целочисленное, целое число, обязательное, Обязательное;
	Сопоставление.Вставить("SIGN_COUNT_MAX", "МаксКолПодписей");
	//6) POSITIONS, Должности, Строковое, текстовое поле, обязательное, Обязательное;
	Сопоставление.Вставить("POSITIONS", "Должности");
	
	Возврат Сопоставление;

КонецФункции

// Возвращает массив структур, ключ которой - имя реквизита справочника, а значение - имя поля таблицы актуальных в общей форме загрузки.
// 
// Возвращаемое значение:
//   - Массив
//
Функция ПолучитьЗагружаемыеПоляЕГИСЗ() Экспорт
	
	Поля = Новый Структура;
	Поля.Вставить("УИДЕГИСЗ", "УИДЕГИСЗ");
	Поля.Вставить("ВидДокумента", "ВидДокумента");
	Поля.Вставить("Роль", "Роль");
	Поля.Вставить("МинКолПодписей", "МинКолПодписей");
	Поля.Вставить("МаксКолПодписей", "МаксКолПодписей");
	Поля.Вставить("Должности", "Должности");
	Поля.Вставить("Наименование", "Наименование");
	
	Возврат Поля;
	
КонецФункции

// Дополнительные атрибуты классификатора для загрузки.
// 
// Возвращаемое значение:
//  Соответствие - дополнительные атрибуты.
//
Функция ПолучитьДополнительныеАтрибуты() Экспорт
	
	Поля = Новый Соответствие;
	
	//7) POSITION_CONTROL, Способ проверки должностей, Строковое, текстовое поле, обязательное, Обязательное;
	Поля.Вставить("POSITION_CONTROL", "POSITION_CONTROL");
	//8) SPECIALITY_CONTROL, Обязательность указания специальности, Строковое, текстовое поле, обязательное, Обязательное;
	Поля.Вставить("SPECIALITY_CONTROL", "SPECIALITY_CONTROL");
	//9) START_DATE, Дата начала действия правила, Дата, дата, обязательное, Обязательное;
	Поля.Вставить("START_DATE", "START_DATE");
	//10) END_DATE, Дата окончания действия правила, Дата, дата, не обязательное;
	Поля.Вставить("END_DATE", "END_DATE");
	
	Возврат Поля;
	
КонецФункции

// Загрузка справочника: событие перед обработкой таблицы классификатора
//
// Параметры:
//  ТаблицаКлассификатор - ТаблицаЗначений - таблица классификатора. 
// 
Процедура ПередОбработкойТаблицыКлассификатора(ТаблицаКлассификатор) Экспорт
	
	Для Каждого СтрокаТаблицы Из ТаблицаКлассификатор Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ВидДокумента) Тогда
			СтрокаТаблицы.Наименование = СтрШаблон("%1 (%2)", Строка(СтрокаТаблицы.ВидДокумента), Строка(СтрокаТаблицы.УИДЕГИСЗ));
		Иначе
			СтрокаТаблицы.Наименование = Строка(СтрокаТаблицы.УИДЕГИСЗ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Формирует массив структур, ключи которых - поля для поиска существующих элементов при загрузки из ФР НСИ ЕГИСЗ,
//  а порядок в массиве - приоритет использования способов поиска.
// 
// Возвращаемое значение:
//  Массив - наборы ключей поиска.
//
Функция ПолучитьПорядокПоискаСуществующихОбъектов() Экспорт
	
	ПорядокПоиска = Новый Массив;
	
	ПоляПоиска = Новый Структура;
	ПоляПоиска.Вставить("УИДЕГИСЗ", "УИДЕГИСЗ");
		
	ПорядокПоиска.Добавить(ПоляПоиска);
	
	Возврат ПорядокПоиска;
	
КонецФункции

#КонецОбласти

#КонецОбласти
